Австралия/src/AccumulationRegisters/AccountsPayable/AccountsPayable.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>AccountsPayable</name>
  <resources>
    <name>Amount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>AmountCur</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>AmountForPayment</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>AmountForPaymentCur</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ContentOfAccountingRecord</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ZeroInvoice</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>PresentationCurrency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>SettlementsType</name>
    <type>
      <types>EnumRef.SettlementsTypes</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Counterparty</name>
    <type>
      <types>CatalogRef.Counterparties</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Contract</name>
    <type>
      <types>CatalogRef.CounterpartyContracts</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Document</name>
    <type>
      <types>DocumentRef.RegistersCorrection</types>
      <types>DocumentRef.SalesInvoice</types>
      <types>DocumentRef.SupplierInvoice</types>
      <types>DocumentRef.SubcontractorInvoiceReceived</types>
      <types>DocumentRef.CustomsDeclaration</types>
      <types>DocumentRef.PaymentExpense</types>
      <types>DocumentRef.DebitNote</types>
      <types>DocumentRef.ExpenseReport</types>
      <types>DocumentRef.CashReceipt</types>
      <types>DocumentRef.AccountSalesToConsignor</types>
      <types>DocumentRef.OnlineReceipt</types>
      <types>DocumentRef.CashVoucher</types>
      <types>DocumentRef.ArApAdjustments</types>
      <types>DocumentRef.PaymentReceipt</types>
      <types>DocumentRef.OnlinePayment</types>
      <types>DocumentRef.AdditionalExpenses</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Order</name>
    <type>
      <types>DocumentRef.SubcontractorOrderIssued</types>
      <types>DocumentRef.PurchaseOrder</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Австралия/src/AccumulationRegisters/AccountsReceivable/AccountsReceivable.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>AccountsReceivable</name>
  <resources>
    <name>Amount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>AmountCur</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>AmountForPayment</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>AmountForPaymentCur</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ContentOfAccountingRecord</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ZeroInvoice</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>PresentationCurrency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>SettlementsType</name>
    <type>
      <types>EnumRef.SettlementsTypes</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Counterparty</name>
    <type>
      <types>CatalogRef.Counterparties</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Contract</name>
    <type>
      <types>CatalogRef.CounterpartyContracts</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Document</name>
    <type>
      <types>DocumentRef.RegistersCorrection</types>
      <types>DocumentRef.FixedAssetSale</types>
      <types>DocumentRef.SalesInvoice</types>
      <types>DocumentRef.AccountSalesFromConsignee</types>
      <types>DocumentRef.SupplierInvoice</types>
      <types>DocumentRef.PaymentExpense</types>
      <types>DocumentRef.DebitNote</types>
      <types>DocumentRef.CashReceipt</types>
      <types>DocumentRef.SalesOrder</types>
      <types>DocumentRef.CreditNote</types>
      <types>DocumentRef.SubcontractorInvoiceIssued</types>
      <types>DocumentRef.AccountSalesToConsignor</types>
      <types>DocumentRef.OnlineReceipt</types>
      <types>DocumentRef.CashVoucher</types>
      <types>DocumentRef.ArApAdjustments</types>
      <types>DocumentRef.PaymentReceipt</types>
      <types>DocumentRef.OnlinePayment</types>
      <types>DocumentRef.AdditionalExpenses</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Order</name>
    <type>
      <types>DocumentRef.SalesOrder</types>
      <types>DocumentRef.SubcontractorOrderReceived</types>
      <types>DocumentRef.WorkOrder</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Австралия/src/AccumulationRegisters/MiscellaneousPayable/MiscellaneousPayable.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>MiscellaneousPayable</name>
  <resources>
    <name>Amount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>AmountCur</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>PostingContent</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>GLAccount</name>
    <type>
      <types>ChartOfAccountsRef.PrimaryChartOfAccounts</types>
    </type>
  </attributes>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>PresentationCurrency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Counterparty</name>
    <type>
      <types>CatalogRef.Counterparties</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Contract</name>
    <type>
      <types>CatalogRef.CounterpartyContracts</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Австралия/src/AccumulationRegisters/Sales/Sales.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Sales</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Quantity</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Amount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>VATAmount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Cost</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>AmountCur</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>VATAmountCur</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>SalesTaxAmount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>SalesTaxAmountCur</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>OfflineRecord</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ZeroInvoice</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Products</name>
    <type>
      <types>CatalogRef.Products</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Characteristic</name>
    <type>
      <types>CatalogRef.ProductsCharacteristics</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Batch</name>
    <type>
      <types>CatalogRef.ProductsBatches</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ownership</name>
    <type>
      <types>CatalogRef.InventoryOwnership</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Document</name>
    <type>
      <types>DocumentRef.RegistersCorrection</types>
      <types>DocumentRef.SalesInvoice</types>
      <types>DocumentRef.AccountSalesFromConsignee</types>
      <types>DocumentRef.InventoryTransfer</types>
      <types>DocumentRef.SupplierInvoice</types>
      <types>DocumentRef.SalesSlip</types>
      <types>DocumentRef.ExpenseReport</types>
      <types>DocumentRef.SalesOrder</types>
      <types>DocumentRef.SubcontractorInvoiceIssued</types>
      <types>DocumentRef.ShiftClosure</types>
      <types>DocumentRef.AccountSalesToConsignor</types>
      <types>DocumentRef.GoodsIssue</types>
      <types>DocumentRef.WorkOrder</types>
    </type>
  </dimensions>
  <dimensions>
    <name>VATRate</name>
    <type>
      <types>CatalogRef.VATRates</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>PresentationCurrency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Counterparty</name>
    <type>
      <types>CatalogRef.Counterparties</types>
    </type>
  </dimensions>
  <dimensions>
    <name>SalesOrder</name>
    <type>
      <types>DocumentRef.SalesOrder</types>
      <types>DocumentRef.SubcontractorOrderReceived</types>
      <types>DocumentRef.WorkOrder</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Department</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Responsible</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </dimensions>
  <dimensions>
    <name>SalesRep</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>BundleProduct</name>
    <type>
      <types>CatalogRef.Products</types>
    </type>
  </dimensions>
  <dimensions>
    <name>BundleCharacteristic</name>
    <type>
      <types>CatalogRef.ProductsCharacteristics</types>
    </type>
  </dimensions>
  <dimensions>
    <name>DeliveryStartDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>DeliveryEndDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Австралия/src/CommonModules/AdditionalInformationPanel/Module.bsl
#Region Public

Procedure ReadAdditionalInformationPanelData(Form, Counterparty) Export 
	
	Items = Form.Items;
	
	ViewStatemenOfAccount = AccessRight("View", Metadata.Reports.StatementOfAccount);
	ViewNetSales = AccessRight("View", Metadata.Reports.NetSales);

	Items.AdditionalInformationPanel.Visible = ValueIsFilled(Counterparty);
	
	If Not ValueIsFilled(Counterparty) Then
		Return;
	EndIf;
	
	LargeFont = StyleFonts.InformationPanelLargeFont;
	SmallFont  = StyleFonts.InformationPanelSmallFont;
	
	Company = Undefined;
	
	Query = New Query;
	Query.SetParameter("Counterparty", Counterparty);
	
	If ViewStatemenOfAccount Then
		
		Query.Text = 
		"SELECT ALLOWED
		|	AccountsPayableBalance.PresentationCurrency AS PresentationCurrency,
		|	-AccountsPayableBalance.AmountBalance AS AmountBalance
		|INTO TT_PRM
		|FROM
		|	AccumulationRegister.AccountsPayable.Balance(
		|			,
		|			Counterparty = &Counterparty
		|				AND &CompanyFilter) AS AccountsPayableBalance
		|
		|UNION ALL
		|
		|SELECT
		|	AccountsReceivableBalance.PresentationCurrency,
		|	AccountsReceivableBalance.AmountBalance
		|FROM
		|	AccumulationRegister.AccountsReceivable.Balance(
		|			,
		|			Counterparty = &Counterparty
		|				AND &CompanyFilter) AS AccountsReceivableBalance
		|
		|UNION ALL
		|
		|SELECT
		|	MiscellaneousPayableBalance.PresentationCurrency,
		|	MiscellaneousPayableBalance.AmountBalance
		|FROM
		|	AccumulationRegister.MiscellaneousPayable.Balance(
		|			,
		|			Counterparty = &Counterparty
		|				AND &CompanyFilter) AS MiscellaneousPayableBalance
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|SELECT
		|	SUM(TT_PRM.AmountBalance) AS Amount,
		|	TT_PRM.PresentationCurrency AS PresentationCurrency
		|FROM
		|	TT_PRM AS TT_PRM
		|
		|GROUP BY
		|	TT_PRM.PresentationCurrency";
		
		
		If Form.Object.Property("Company", Company) Then 
			
			Query.Text = StrReplace(Query.Text, "&CompanyFilter", "Company = &Company");
			Query.SetParameter("Company", Company);
			
		Else 
			
			Query.SetParameter("CompanyFilter", True);
			
		EndIf;
		
		Sel = Query.Execute().Select();
		
		EmptyAmount = (Sel.Count() = 0);
		
		FSParts = New Array;
		
		While Sel.Next() Or EmptyAmount Do 
			
			If EmptyAmount Then
				Amount = 0;
			Else
				Amount = Sel.Amount;
			EndIf;			
			
			If Amount < 0 Then
				FSParts.Add(New FormattedString(NStr("en = 'Amount owed'; ru = 'Сумма задолженности';pl = 'Kwota należna';es_ES = 'Cantidad adeudada';es_CO = 'Cantidad adeudada';tr = 'Alacak';it = 'Importo dovuto';de = 'Geschuldeter Betrag'") + " ", LargeFont));
				Amount = -Amount;
			Else
				FSParts.Add(New FormattedString(NStr("en = 'Amount due'; ru = 'Сумма долга';pl = 'Kwota należna';es_ES = 'Cantidad debida';es_CO = 'Cantidad debida';tr = 'Borç';it = 'Importo dovuto';de = 'Fälliger Betrag'") + " ", LargeFont));
			EndIf;
			
			AmountInWords = Format(Amount, "NFD=2; NDS=,; NGS=' '; NZ=0,00");
			CommaPosition = StrFind(AmountInWords, ",");
			
			NumberParts = New Array;
			NumberParts.Add(New FormattedString(Left(AmountInWords, CommaPosition), LargeFont));
			NumberParts.Add(New FormattedString(Mid(AmountInWords, CommaPosition + 1), SmallFont));
			
			FSParts.Add(New FormattedString(NumberParts, , , , "DebtBalance"));
			
			FSParts.Add(" " + ?(EmptyAmount, "", Sel.PresentationCurrency) + Chars.LF);
			
			EmptyAmount = False;
		EndDo;
			
		Items.DebtBalance.Title = New FormattedString(FSParts, , StyleColors.MinorInscriptionText);
		
	EndIf;
	
	If ViewNetSales Then
		
		Query.Text =
		"SELECT ALLOWED
		|	SalesTurnovers.PresentationCurrency AS PresentationCurrency,
		|	SUM(SalesTurnovers.AmountTurnover) AS Amount
		|FROM
		|	AccumulationRegister.Sales.Turnovers(
		|			,
		|			,
		|			,
		|			Document REFS Document.SalesInvoice
		|				AND Counterparty = &Counterparty
		|				AND &CompanyFilter) AS SalesTurnovers
		|
		|GROUP BY
		|	SalesTurnovers.PresentationCurrency
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|SELECT ALLOWED TOP 1
		|	SalesInvoice.Ref AS Document,
		|	SalesInvoice.Date AS Date
		|FROM
		|	Document.SalesInvoice AS SalesInvoice
		|WHERE
		|	SalesInvoice.Posted
		|	AND SalesInvoice.Counterparty = &Counterparty
		|
		|ORDER BY
		|	SalesInvoice.PointInTime DESC";
		
		If Form.Object.Property("Company", Company) Then 
			
			Query.Text = StrReplace(Query.Text, "&CompanyFilter", "Company = &Company");
			Query.SetParameter("Company", Company);
			
		Else 
			
			Query.SetParameter("CompanyFilter", True);
			
		EndIf;
		
		QueryResults = Query.ExecuteBatch();
		
		Sel = QueryResults[0].Select();
		
		EmptySales = (Sel.Count() = 0);
		
		FSParts = New Array;
		FSParts.Add(New FormattedString(NStr("en = 'Sales'; ru = 'Продажи';pl = 'Sprzedaż';es_ES = 'Ventas';es_CO = 'Ventas';tr = 'Satış';it = 'Vendite';de = 'Verkäufe'") + " ", LargeFont));
		
		While Sel.Next() Or EmptySales Do 
			
			If EmptySales Then
				Amount = 0;
			Else
				Amount = Sel.Amount;
			EndIf;
			                                                		
			AmountInWords = Format(Amount, "NFD=2; NDS=,; NGS=' '; NZ=0,00");
			CommaPosition = StrFind(AmountInWords, ",");
			
			NumberParts = New Array;
			NumberParts.Add(New FormattedString(Left(AmountInWords, CommaPosition), LargeFont));
			NumberParts.Add(New FormattedString(Mid(AmountInWords, CommaPosition + 1), SmallFont));
			
			FSParts.Add(New FormattedString(NumberParts, , , , "Sales"));
			FSParts.Add(" " + ?(EmptySales, "", Sel.PresentationCurrency) + Chars.LF);
			
			EmptySales = False;
		EndDo;
		
		Items.SalesAmount.Title = New FormattedString(FSParts, , StyleColors.MinorInscriptionText);
		
		Sel = QueryResults[1].Select();
		If Sel.Next() Then
			Date = Sel.Date;
			Hyperlink = GetURL(Sel.Document);
		Else
			Date = '00010101';
			Hyperlink = "";
		EndIf;
		
		FSParts = New Array;
		FSParts.Add(NStr("en = 'Last sale'; ru = 'Последняя продажа';pl = 'Ostatnia sprzedaż';es_ES = 'Última venta';es_CO = 'Última venta';tr = 'Son satış';it = 'Ultima vendita';de = 'Letzter Verkauf'") + " ");
		FSParts.Add(New FormattedString(Format(Date, "L=en; DLF=D; DE=<none>"), , , , Hyperlink));
		
		Items.LastSale.Title = New FormattedString(FSParts, LargeFont, StyleColors.MinorInscriptionText);
		
	EndIf;
	
	If GetFunctionalOption("UseDocumentEvent") Then
		
		Query.Text =
		"SELECT ALLOWED DISTINCT
		|	EventParticipants.Ref AS Ref
		|INTO TT_Events
		|FROM
		|	Document.Event.Participants AS EventParticipants
		|WHERE
		|	EventParticipants.Contact = &Counterparty
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|SELECT ALLOWED TOP 1
		|	Events.Ref AS Event,
		|	Events.EventBegin AS Date
		|FROM
		|	TT_Events AS TT_Events
		|		INNER JOIN Document.Event AS Events
		|		ON TT_Events.Ref = Events.Ref
		|WHERE
		|	NOT Events.DeletionMark
		|
		|ORDER BY
		|	Events.EventBegin DESC";
		
		Sel = Query.Execute().Select();
		If Sel.Next() Then
			Date = Sel.Date;
			Hyperlink = GetURL(Sel.Event);
		Else
			Date = '00010101';
			Hyperlink = "";
		EndIf;
		
		FSParts = New Array;
		FSParts.Add(NStr("en = 'Last event'; ru = 'Последнее событие';pl = 'Ostatnie wydarzenie';es_ES = 'Último evento';es_CO = 'Último evento';tr = 'Son etkinlik';it = 'Ultimo evento';de = 'Letztes Ereignis'") + " ");
		FSParts.Add(New FormattedString(Format(Date, "L=en; DLF=D; DE=<none>"), , , , Hyperlink));
		
		Items.LastEvent.Title = New FormattedString(FSParts, LargeFont, StyleColors.MinorInscriptionText);
		
	EndIf;
	
EndProcedure

#EndRegion
